---
kind: method
id: M:Autodesk.Revit.DB.DimensionSegmentArrayIterator.#ctor
source: html/d05f72ce-ec4b-fa36-2ec0-350979fd7084.htm
---
# Autodesk.Revit.DB.DimensionSegmentArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public DimensionSegmentArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.